src/bsl/Catalogs/гкс_СчитывателиUHFRFID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_СчитывателиUHFRFID</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСлужбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПортаСлужбы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApiUrl</Name>
					<Comment>REST end-point URL</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСчитывателя</Name>
					<Comment>Имя последовательного порта USB считывателя </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутСоединения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Catalogs/гкс_СчитывателиUHFRFID/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПривязкуПользователейКДругимСчитывателям(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПривязкуПользователейКДругимСчитывателям(Отказ)
	
	ШаблонТекстаСообщенияПользователю = НСтр("ru='Пользователь %1 уже указан в другом считывателе %2'");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапросаПроверитьПривязкуПользователейКДругимСчитывателям();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаСообщенияПользователю,
			                                                                     ВыборкаДетальныеЗаписи.ПользовательПредставление,
																				 ВыборкаДетальныеЗаписи.ДругойСчитывательПредставление);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ВыборкаДетальныеЗаписи.ДругойСчитыватель);
		
	КонецЦикла;

	
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаПроверитьПривязкуПользователейКДругимСчитывателям()
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПользователиСчитывателя.Ссылка) КАК ПользовательПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПользователиДругихСчитывателей.Ссылка) КАК ДругойСчитывательПредставление,
	|	ПользователиДругихСчитывателей.Ссылка КАК ДругойСчитыватель
	|ИЗ
	|	Справочник.гкс_СчитывателиUHFRFID.Пользователи КАК ПользователиСчитывателя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_СчитывателиUHFRFID.Пользователи КАК ПользователиДругихСчитывателей
	|		ПО ПользователиСчитывателя.Пользователь = ПользователиДругихСчитывателей.Пользователь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_СчитывателиUHFRFID КАК ДругиеСчитыватели
	|		ПО (ПользователиДругихСчитывателей.Ссылка = ДругиеСчитыватели.Ссылка)
	|ГДЕ
	|	ПользователиСчитывателя.Ссылка = &Ссылка
	|	И НЕ ПользователиДругихСчитывателей.Ссылка = &Ссылка
	|	И НЕ ДругиеСчитыватели.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
